64KKomega/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  4.x                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 1;

vertices
(
    //back up
    (0 0 0)                  		//0
    (231 0 0)                    	//1 
    (231 92.4 0)                   	//2   
    (0 92.4 0)            		//3 
    
    //front up
    (0 0 1)                  		//4
    (231 0 1)                    	//5 
    (231 92.4 1)                   	//6   
    (0 92.4 1)            		//7 
    
);

blocks
(
    //up
    hex (0 1 2 3 4 5 6 7) (100 50 1) simpleGrading (1 1 1)       	//0
     
);

patches
(
    
    patch outlet
    (
        
        (1 5 6 2)
        
    )
    symmetryPlane top
    (
        (7 3 2 6)

    )
        
    symmetryPlane bottom
    (
        (4 5 1 0)
    )

    patch inlet
    (
        //up
        (0 3 7 4)    
    )
    
    empty back 
    (
       //up
       (4 7 6 5)

    )

    empty front
    (
       //up
       (3 0 1 2)
    )
     
);

mergePatchPairs
(
);

// ************************************************************************* //
